{
    "enqueue": {
        "name": "qme",
        "asAdmin": false,
        "responses": {
            "alreadyQueued": "<@{0}> you are already in the queue. \nIf you want to leave the queue you can cancel anytime with */cancel*.",
            "enqueue": "<@{0}> I added you to the queue. You can leave whenever you like by typing */cancel*",
            "infoUserFilled": "Someone enqueued just now <@{0}>. You can get the next person in line with */next*",
            "infoUserEmpty": "The queue is empty again. I'll let you know if someone joins. :sunglasses:"
        }
    },
    "cancel": {
        "name": "cancel",
        "asAdmin": false,
        "responses": {
            "notInQueue": "<@{0}> you are currently not in the queue. \n You are able to join the queue by typing */qme*.",
            "removedUser": "<@{0}> I removed you from the queue. You can join again by typing */qme*"
        }
    },
    "peek": {
        "name": "peek",
        "asAdmin": true,
        "responses": {
            "empty": "<@{0}, the queue is currently empty. If you want me to notice you if someone enqueues you can use */listen*.",
            "numMembers": "<@{0}, here are the {1} next members in line.",
            "lessMembers": "<@{0}, there aren't {1} members in line. Currently lthere are only {2}.",
            "tooMuch": "There currently {0} members in the queue, I can only output {1}. Try to limit the ouput by using */peek <number of people>*.",
            "all": "<@{0}>, that's all the members in the queue."
        }
    },
    "dequeue": {
        "name": "next",
        "asAdmin": true,
        "responses": {
            "noAdmin": "Sorry <@{0}> but I can't give you that Info. Check with someone who can grant you the **Bot Admin** Role.",
            "queueEmpty": "Currently there's no one in the queue <@{0}>. I can get back to you if someone enters, simply type */listen*",
            "nextUp": "The next user in the queue is <@{0}>. You can put him back into the queue with */putback*."
        }
    },
    "putBack": {
        "name": "putback",
        "asAdmin": true,
        "responses": {
            "success": "<@{0}, I have put the user <@{1}> back into the queue. :wink:"
        }
    },
    "list": {
        "name": "list",
        "asAdmin": false,
        "responses": {
            "enqueueFirst": "<@{0}> the queue is empty right now. \n That's you'r chance be the first and join the queue with */qme*.",
            "notInLine": "<@{0}> you are currently not in line. If you want to join the queue you can by typing */qme*",
            "nextUpt": "<@{0}> you are next up in the queue! :wink:",
            "membersBefore": "<@{0}> there's currently {1} members before you."
        }
    },
    "listen": {
        "name": "listen",
        "asAdmin": true,
        "responses": {
            "stopListen": "Okay <@{0}>, but keep in mind that the next members who enqueue will be unnotice. You can always give me a signal with */listen* to start informing you.",
            "startListen": "I'll let you know if someone enqueues <@{0}>. If you don't want me to to give you a hint you can type */listen stop*.",
            "alreadyListen": "I already noted, that you want hints about the members which enqueued. Don't worry <@{0}> I'll keep you up to date!"
        }
    },
    "help": {
        "name": "help",
        "asAdmin": false,
        "responses": {
            "general": "<@{0}> you can use the following commands to chat with me: **{1}**.\n\n If you want more information about a specific command just type */help <name of the command>*.",
            "enqueue":  "You can use */{1}* to get into the queue. Just type it and leave the rest to me <@{0}>. :+1:",
            "dequeue": "<@{0}>, you can get the next person in line with */{1}*. But take care if you take them out of the queue they are out. You can put them back by using */putback*.",
            "cancel": "<@{0}>, you can use */{1}* to get out of the queue if you don't want to be in line anymore. ",
            "list": "<@{0}>, you can use this command to check your place in line. Try it, just type */{1}*.",
            "listen": "By typing */{1}* you can make me listen to the queue for you. If someone joins the queue I will give you a hint <@{0}>."
        }
    },
    "_defaults_": {
        "categoryNonExistent": "<@{0}> I can't find the configured channel category. You may need to create it and the depending channels for members and admins. You can check your current configuration with */config show*.",
        "channelNonExistent": "",
        "messageNotOnCategory": "<@{0}>, you can't communication with on this channel. You can check the configuration with */config show*.",
        "wrongChannel": "<@{0}>, seems like you are on the wrong channel. The category ist right but should configure a channel named {1} to communicate with me",
        "channelConfig": "<@{0}>, you are trying to contact me from a channel which is not configured to be used by bots. You can check you'r configuration by typing */config show*",
        "directMessage": "<@{0}>, I'm not up for private chatter. You need to contact me from the server or else I can't enqueue you. :man_shrugging:"
    }
}